Конфигурация/DataProcessors/Распоряжения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Распоряжения</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ДоговорыСчетовДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДоговорыСчетовДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантДлиныСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДлиныСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/Рейтинги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Рейтинги</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРейтинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияРейтингов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрогнозРейтинга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПрогнозыРейтингов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереходаВАрхив</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УровеньРейтинга</Name>
					<Comment>Заполняется автоматически</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Агрегатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РейтинговоеАгентство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РейтинговыеАгентства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыРейтинговыхАгентств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыРейтингов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/Распоряжения/Ext/ManagerModule.bsl
Процедура СоздатьРаспоряжения(ВыбПлановыеРаспоряжения) Экспорт 
	
	ТекДата = ТекущаяДатаСеанса();
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийБэкОфиса"));
	ТаблицаДанных.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ТаблицаДанных.Колонки.Добавить("РасчетныйСчет", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	ТаблицаДанных.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДанных.Колонки.Добавить("Процент", Метаданные.ОпределяемыеТипы.ПроцентнаяСтавка.Тип);
	ТаблицаДанных.Колонки.Добавить("ДатаРазмещения", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ДатаВозврата", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("Банк", Новый ОписаниеТипов("СправочникСсылка.Банки"));
	ТаблицаДанных.Колонки.Добавить("Индекс", Новый ОписаниеТипов("Число"));
	
	Для Каждого ТекРаспоряжение Из ВыбПлановыеРаспоряжения Цикл
		
		ТекСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(ТекСтрока, ТекРаспоряжение); 
		ТекСтрока.Индекс = ВыбПлановыеРаспоряжения.Найти(ТекРаспоряжение);
				
	КонецЦикла; 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область Текст_Запроса
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.ВидОперации КАК ВидОперации,
		|	ТаблицаДанных.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ТаблицаДанных.РасчетныйСчет КАК РасчетныйСчет,
		|	ТаблицаДанных.Валюта КАК Валюта,
		|	ТаблицаДанных.Процент КАК Процент,
		|	ТаблицаДанных.ДатаРазмещения КАК ДатаРазмещения,
		|	ТаблицаДанных.ДатаВозврата КАК ДатаВозврата,
		|	ТаблицаДанных.Банк КАК Банк,
		|	ТаблицаДанных.Индекс КАК Индекс
		|ПОМЕСТИТЬ _ТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Распоряжение.Организация КАК Организация,
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Распоряжение.ВидОперации КАК ВидОперации,
		|	Распоряжение.РасчетныйСчет КАК РасчетныйСчет,
		|	Распоряжение.Банк КАК Банк,
		|	Распоряжение.Процент КАК Процент,
		|	Распоряжение.Валюта КАК Валюта,
		|	Распоряжение.ДатаРазмещения КАК ДатаРазмещения,
		|	Распоряжение.ДатаВозврата КАК ДатаВозврата,
		|	ЛОЖЬ КАК ЭтоНовый
		|ПОМЕСТИТЬ _СводнаяТаблица
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеМНО КАК ДокСторнирование
		|		ПО (Распоряжение.Ссылка = ВЫРАЗИТЬ(ДокСторнирование.МНО КАК Документ.МНО).Основание)
		|			И (ДокСторнирование.Проведен)
		|ГДЕ
		|	НЕ Распоряжение.ПометкаУдаления
		|	И Распоряжение.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(Распоряжение.Дата, ДЕНЬ) = &НачалоДня
		|	И ДокСторнирование.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ТаблицаДанных.Организация,
		|	_ТаблицаДанных.СчетДоверительногоУправления,
		|	_ТаблицаДанных.ВидОперации,
		|	_ТаблицаДанных.РасчетныйСчет,
		|	_ТаблицаДанных.Банк,
		|	_ТаблицаДанных.Процент,
		|	_ТаблицаДанных.Валюта,
		|	_ТаблицаДанных.ДатаРазмещения,
		|	_ТаблицаДанных.ДатаВозврата,
		|	ИСТИНА
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СводнаяТаблица.Организация КАК Организация,
		|	_СводнаяТаблица.ВидОперации КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА _СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА _СводнаяТаблица.РасчетныйСчет.Банк.Код
		|		КОГДА _СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА _СводнаяТаблица.Банк.Код
		|	КОНЕЦ КАК БИК,
		|	_СводнаяТаблица.Валюта КАК Валюта,
		|	_СводнаяТаблица.ДатаРазмещения КАК ДатаРазмещения,
		|	_СводнаяТаблица.ДатаВозврата КАК ДатаВозврата,
		|	МАКСИМУМ(_СводнаяТаблица.Процент) КАК Процент
		|ПОМЕСТИТЬ _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам
		|ИЗ
		|	_СводнаяТаблица КАК _СводнаяТаблица
		|ГДЕ
		|	_СводнаяТаблица.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СводнаяТаблица.Организация,
		|	_СводнаяТаблица.ВидОперации,
		|	ВЫБОР
		|		КОГДА _СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА _СводнаяТаблица.РасчетныйСчет.Банк.Код
		|		КОГДА _СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА _СводнаяТаблица.Банк.Код
		|	КОНЕЦ,
		|	_СводнаяТаблица.Валюта,
		|	_СводнаяТаблица.ДатаРазмещения,
		|	_СводнаяТаблица.ДатаВозврата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СводнаяТаблица.Организация КАК Организация,
		|	_СводнаяТаблица.ВидОперации КАК ВидОперации,
		|	_СводнаяТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СводнаяТаблица.РасчетныйСчет КАК РасчетныйСчет,
		|	_СводнаяТаблица.Валюта КАК Валюта,
		|	_СводнаяТаблица.Процент КАК Процент,
		|	_СводнаяТаблица.ДатаРазмещения КАК ДатаРазмещения,
		|	_СводнаяТаблица.ДатаВозврата КАК ДатаВозврата,
		|	_СводнаяТаблица.Банк КАК Банк,
		|	_СводнаяТаблица.ЭтоНовый КАК ЭтоНовый,
		|	ВЫБОР
		|		КОГДА _СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА ВЫРАЗИТЬ(_СводнаяТаблица.РасчетныйСчет КАК Справочник.БанковскиеСчета).Банк.Код
		|		КОГДА _СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА ВЫРАЗИТЬ(_СводнаяТаблица.Банк КАК Справочник.Банки).Код
		|	КОНЕЦ КАК БИК,
		|	_МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.Процент КАК МаксПроцент
		|ПОМЕСТИТЬ _ОшибкиКонтроля
		|ИЗ
		|	_СводнаяТаблица КАК _СводнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам КАК _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам
		|		ПО _СводнаяТаблица.Организация = _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.Организация
		|			И _СводнаяТаблица.ВидОперации = _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.ВидОперации
		|			И _СводнаяТаблица.Валюта = _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.Валюта
		|			И _СводнаяТаблица.ДатаРазмещения = _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.ДатаРазмещения
		|			И _СводнаяТаблица.ДатаВозврата = _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.ДатаВозврата
		|			И (_СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|					И ВЫРАЗИТЬ(_СводнаяТаблица.РасчетныйСчет КАК Справочник.БанковскиеСчета).Банк.Код = _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.БИК
		|				ИЛИ _СводнаяТаблица.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|					И ВЫРАЗИТЬ(_СводнаяТаблица.Банк КАК Справочник.Банки).Код = _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.БИК)
		|			И _СводнаяТаблица.Процент < _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.Процент
		|			И (ВЫРАЗИТЬ(_СводнаяТаблица.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
		|ГДЕ
		|	НЕ _МаксимальнаяСтавкаРаспоряженийПоСобственнымСчетам.ВидОперации ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаДанных.Индекс КАК Индекс
		|ИЗ
		|	_ТаблицаДанных КАК _ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиКонтроля КАК _ОшибкиКонтроля
		|		ПО _ТаблицаДанных.Организация = _ОшибкиКонтроля.Организация
		|			И _ТаблицаДанных.ВидОперации = _ОшибкиКонтроля.ВидОперации
		|			И _ТаблицаДанных.Валюта = _ОшибкиКонтроля.Валюта
		|			И _ТаблицаДанных.ДатаРазмещения = _ОшибкиКонтроля.ДатаРазмещения
		|			И _ТаблицаДанных.ДатаВозврата = _ОшибкиКонтроля.ДатаВозврата
		|			И (_ТаблицаДанных.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|					И ВЫРАЗИТЬ(_ТаблицаДанных.РасчетныйСчет КАК Справочник.БанковскиеСчета).Банк.Код = _ОшибкиКонтроля.БИК
		|				ИЛИ _ТаблицаДанных.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|					И ВЫРАЗИТЬ(_ТаблицаДанных.Банк КАК Справочник.Банки).Код = _ОшибкиКонтроля.БИК)
		|			И (_ТаблицаДанных.СчетДоверительногоУправления = _ОшибкиКонтроля.СчетДоверительногоУправления
		|				ИЛИ ВЫРАЗИТЬ(_ТаблицаДанных.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(перечисление.ВидыДоговоровДоверительногоУправления.Собственный))
		|ГДЕ
		|	_ОшибкиКонтроля.ВидОперации ЕСТЬ NULL";
#КонецОбласти
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.ТекущаяОрганизация); 
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекДата));
	
	Результат = Запрос.Выполнить();
	
	ОшибкиКонтроля = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиКонтроля"].ПолучитьДанные().Выгрузить();
	
	Для Каждого ТекСтрока Из ОшибкиКонтроля Цикл
		
		Если ТекСтрока.ЭтоНовый Тогда
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Распоряжение по счету д/у [" + ТекСтрока.СчетДоверительногоУправления+ "] не будет загружено. Не пройден контроль конфликта интересов,"
				+ " т.к. процентная ставка [" + ТекСтрока.Процент + "] ниже чем процентная ставка [" + ТекСтрока.МаксПроцент + "] распоряжения по собоственному портфелю.");
		Иначе
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В учетной системе обнаружено распоряжение по счету д/у [" + ТекСтрока.СчетДоверительногоУправления+ "]"
				+ " и процентной ставкой [" + ТекСтрока.Процент + "] ниже чем процентная ставка [" + ТекСтрока.МаксПроцент + "] распоряжения по собоственному портфелю.");	
				
		КонецЕсли;
	
	КонецЦикла;
	
	МассивИндексов = Результат.Выгрузить().ВыгрузитьКолонку("Индекс");
	
	Для Инд = 1 - ВыбПлановыеРаспоряжения.Количество() По 0 Цикл
		
		Если МассивИндексов.Найти(-Инд) = Неопределено Тогда
			ВыбПлановыеРаспоряжения.Удалить(-Инд);
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибки = Ложь;
		
		СтрокаРаспоряжения = ВыбПлановыеРаспоряжения[-Инд];
		
		Распоряжение = Документы.Распоряжение.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(Распоряжение, СтрокаРаспоряжения);
		
		Распоряжение.Ответственный = РаботаСПользователями.ТекущийПользователь();
		Распоряжение.ДополнительныеСвойства.Вставить("ПройденКонтрольКонфликтаИнтересов");
		
		Если Не Распоряжение.ПроверитьЗаполнение() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать Распоряжение по клиенту " + СтрокаРаспоряжения.Коды);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЕстьОшибки Тогда
		
			Попытка
				Распоряжение.Записать(РежимЗаписиДокумента.Запись);
				СтрокаРаспоряжения.Вставить("Ссылка", Распоряжение.Ссылка);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать Распоряжение по клиенту " + СтрокаРаспоряжения.Коды);
			КонецПопытки;
		
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьДепозитыИРазмещения(Организация, ИсходныеДанные, СоздатьРазмещение = Истина) Экспорт
	
	МассивДепозитныхВкладов = Новый Массив;
		
	Если ТипЗнч(ИсходныеДанные) <> Тип("ТаблицаЗначений") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные для создания депозитного вклада не соответствует формату");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область ТЕКСТ_ЗАПРОСА
	
	Запрос.Текст =
	 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 	|	ИсходныеДанные.Документ КАК Документ,
	 	|	ИсходныеДанные.УчетныйАктив КАК УчетныйАктив,
	 	|	ИсходныеДанные.РасчетныйСчетДепозита КАК РасчетныйСчетДепозита,
	 	|	ИсходныеДанные.НомерПодтверждения КАК НомерПодтверждения,
	 	|	ИсходныеДанные.ДатаПодтверждения КАК ДатаПодтверждения,
	 	|	ИсходныеДанные.ДепозитЗаключенПоДоговору КАК ДепозитЗаключенПоДоговору,
	 	|	ИсходныеДанные.Биржевой КАК Биржевой
	 	|ПОМЕСТИТЬ _ИсходныеДанные
	 	|ИЗ
	 	|	&ИсходныеДанные КАК ИсходныеДанные
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 	|	Распоряжение.Ссылка КАК Ссылка,
	 	|	Распоряжение.Номер КАК Номер,
	 	|	Распоряжение.Дата КАК Дата,
	 	|	Распоряжение.Организация КАК Организация,
	 	|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	 	|	Распоряжение.ВидОперации КАК ВидОперации,
	 	|	Распоряжение.РасчетныйСчет КАК РасчетныйСчет,
	 	|	Распоряжение.Процент КАК Процент,
	 	|	Распоряжение.ДатаРазмещения КАК ДатаРазмещения,
	 	|	Распоряжение.ДатаВозврата КАК ДатаВозврата,
	 	|	Распоряжение.Банк КАК Банк,
	 	|	Распоряжение.Сумма КАК Сумма,
	 	|	Распоряжение.Валюта КАК Валюта,
	 	|	Распоряжение.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
	 	|	Распоряжение.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
	 	|	Распоряжение.ДоВостребования КАК ДоВостребования,
	 	|	Распоряжение.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК ПроцентнаяСтавкаПриДосрочномЗакрытии,
	 	|	Распоряжение.Субординированность КАК Субординированность,
	 	|	Распоряжение.Биржевой КАК Биржевой,
	 	|	_ИсходныеДанные.УчетныйАктив КАК УчетныйАктив,
	 	|	_ИсходныеДанные.РасчетныйСчетДепозита КАК РасчетныйСчетДепозита,
	 	|	_ИсходныеДанные.НомерПодтверждения КАК НомерПодтверждения,
	 	|	_ИсходныеДанные.ДатаПодтверждения КАК ДатаПодтверждения,
	 	|	_ИсходныеДанные.ДепозитЗаключенПоДоговору КАК ДепозитЗаключенПоДоговору
	 	|ПОМЕСТИТЬ _Распоряжения
	 	|ИЗ
	 	|	Документ.Распоряжение КАК Распоряжение
	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ИсходныеДанные КАК _ИсходныеДанные
	 	|		ПО Распоряжение.Ссылка = _ИсходныеДанные.Документ
	 	|			И (Распоряжение.Организация = &Организация)
	 	|			И (Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента))
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 	|	_Распоряжения.Ссылка КАК Распоряжение,
	 	|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	 	|	Договоры.Контрагент КАК Контрагент,
	 	|	Договоры.Ссылка КАК Ссылка
	 	|ПОМЕСТИТЬ _ГенСоглашения
	 	|ИЗ
	 	|	_Распоряжения КАК _Распоряжения
	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(&ТекущаяДата, Организация = &Организация) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних
	 	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	 	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ТекущаяДата, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
	 	|				ПО Договоры.Ссылка = УсловияДоговоровОбщиеСрезПоследних.Договор
	 	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&ТекущаяДата, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
	 	|				ПО Договоры.Контрагент = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
	 	|					И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
	 	|			ПО ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор = Договоры.Ссылка
	 	|				И (Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам))
	 	|				И (НЕ Договоры.ПометкаУдаления)
	 	|		ПО _Распоряжения.СчетДоверительногоУправления = ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
	 	|			И (ДоговорыСчетовДоверительногоУправленияСрезПоследних.Активный)
	 	|			И (НЕ _Распоряжения.ДепозитЗаключенПоДоговору)
	 	|ГДЕ
	 	|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
	 	|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
	 	|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ТекущаяДата)
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 	|	_Распоряжения.Ссылка КАК Распоряжение,
	 	|	_Распоряжения.Номер КАК Номер,
	 	|	_Распоряжения.Дата КАК Дата,
	 	|	_Распоряжения.Организация КАК Организация,
	 	|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	 	|	_Распоряжения.УчетныйАктив КАК УчетныйАктив,
	 	|	_Распоряжения.ДатаРазмещения КАК ДатаРазмещения,
	 	|	_Распоряжения.РасчетныйСчетДепозита КАК РасчетныйСчетДепозита,
	 	|	_Распоряжения.НомерПодтверждения КАК НомерПодтверждения,
	 	|	_Распоряжения.ДатаПодтверждения КАК ДатаПодтверждения,
	 	|	_ГенСоглашения.Ссылка КАК ГенСоглашение,
	 	|	ДепозитныеВклады.Ссылка КАК ДепозитныйВклад
	 	|ПОМЕСТИТЬ _Ошибки
	 	|ИЗ
	 	|	_Распоряжения КАК _Распоряжения
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ _ГенСоглашения КАК _ГенСоглашения
	 	|		ПО _Распоряжения.Ссылка = _ГенСоглашения.Распоряжение
	 	|			И _Распоряжения.СчетДоверительногоУправления = _ГенСоглашения.СчетДоверительногоУправления
	 	|			И _Распоряжения.Банк.ЮрФизЛицо = _ГенСоглашения.Контрагент
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
	 	|		ПО _Распоряжения.Организация = ДепозитныеВклады.Организация
	 	|			И _Распоряжения.РасчетныйСчетДепозита = ДепозитныеВклады.БанковскийСчет
	 	|			И _Распоряжения.ДатаРазмещения = ДепозитныеВклады.ДатаРегистрации
	 	|			И (НЕ ДепозитныеВклады.ПометкаУдаления)
	 	|ГДЕ
	 	|	(_Распоряжения.УчетныйАктив = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ПустаяСсылка)
	 	|			ИЛИ _Распоряжения.РасчетныйСчетДепозита = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	 	|			ИЛИ (_Распоряжения.НомерПодтверждения = """"
	 	|				ИЛИ _Распоряжения.ДатаПодтверждения = ДАТАВРЕМЯ(1, 1, 1))
	 	|				И НЕ _ГенСоглашения.Ссылка ЕСТЬ NULL
	 	|			ИЛИ НЕ ДепозитныеВклады.Ссылка ЕСТЬ NULL)
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 	|	_Распоряжения.Ссылка КАК Распоряжение,
	 	|	_Распоряжения.Номер КАК Номер,
	 	|	_Распоряжения.Дата КАК Дата,
	 	|	_Распоряжения.Организация КАК Организация,
	 	|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	 	|	_Распоряжения.ВидОперации КАК ВидОперации,
	 	|	_Распоряжения.РасчетныйСчет КАК РасчетныйСчет,
	 	|	ВЫБОР
	 	|		КОГДА _Распоряжения.Биржевой
	 	|			ТОГДА ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
	 	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
	 	|	КОНЕЦ КАК МестоХранения,
	 	|	_Распоряжения.Процент КАК Процент,
	 	|	_Распоряжения.ДатаРазмещения КАК ДатаРазмещения,
	 	|	_Распоряжения.ДатаВозврата КАК ДатаВозврата,
	 	|	_Распоряжения.Банк КАК Банк,
	 	|	_Распоряжения.Сумма КАК Сумма,
	 	|	_Распоряжения.Валюта КАК Валюта,
	 	|	_Распоряжения.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
	 	|	_Распоряжения.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
	 	|	_Распоряжения.ДоВостребования КАК ДоВостребования,
	 	|	_Распоряжения.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК ПроцентнаяСтавкаПриДосрочномЗакрытии,
	 	|	_Распоряжения.Субординированность КАК Субординированность,
	 	|	_Распоряжения.УчетныйАктив КАК УчетныйАктив,
	 	|	_Распоряжения.РасчетныйСчетДепозита КАК РасчетныйСчетДепозита,
	 	|	_Распоряжения.НомерПодтверждения КАК НомерПодтверждения,
	 	|	_Распоряжения.ДатаПодтверждения КАК ДатаПодтверждения
	 	|ИЗ
	 	|	_Распоряжения КАК _Распоряжения
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ _Ошибки КАК _Ошибки
	 	|		ПО _Распоряжения.Ссылка = _Ошибки.Распоряжение
	 	|ГДЕ
	 	|	_Ошибки.Распоряжение ЕСТЬ NULL";
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсходныеДанные", ИсходныеДанные);
	
	ВыборкаРаспоряжений = Запрос.Выполнить().Выбрать();
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_Ошибки"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаОшибок.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаОшибок.УчетныйАктив) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При создании депозитного вклада не указан учетный актив. Распоряжение [" + ВыборкаОшибок.Распоряжение + "]. Счету ДУ [" + ВыборкаОшибок.СчетДоверительногоУправления + "].");  
		Конецесли;
		
		Если Не ЗначениеЗаполнено(ВыборкаОшибок.РасчетныйСчетДепозита) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При создании депозитного вклада не указан расчетный счет депозитного вклада. Распоряжение [" + ВыборкаОшибок.Распоряжение + "]. Счету ДУ [" + ВыборкаОшибок.СчетДоверительногоУправления + "]."); 	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаОшибок.ГенСоглашение) Тогда
			
			Если Не ЗначениеЗаполнено(ВыборкаОшибок.НомерПодтверждения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При создании депозитного вклада не заполнен номер подтверждения. Распоряжение [" + ВыборкаОшибок.Распоряжение + "]. Счету ДУ [" + ВыборкаОшибок.СчетДоверительногоУправления + "]."); 	
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаОшибок.ДатаПодтверждения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена дата подтверждения. Распоряжение [" + ВыборкаОшибок.Распоряжение + "]. Счету ДУ [" + ВыборкаОшибок.СчетДоверительногоУправления + "]."); 	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаОшибок.ДепозитныйВклад) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При формировании нового депозитного вклада обнаружен вклад  [" + ВыборкаОшибок.ДепозитныйВклад + "] с аналогичной датой размещения [" + Формат(ВыборкаОшибок.ДатаРазмещения, "ДЛФ=Д") + "] и счетом [" + ВыборкаОшибок.РасчетныйСчетДепозита + "]."); 	
		КонецЕсли;
		
	КонецЦикла;
	
	Пока ВыборкаРаспоряжений.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Если ЗначениеЗаполнено(ВыборкаРаспоряжений.НомерПодтверждения) Тогда
			
			ВидНумерации = Справочники.ВидыНумерацииОбъектов.ПолучитьВидНумерацииОперации(
							ТипЗнч(ВыборкаРаспоряжений.Распоряжение), 
			                ВыборкаРаспоряжений.Дата, 
						    Организация, 
							ВыборкаРаспоряжений.СчетДоверительногоУправления, 
							ВыборкаРаспоряжений.Банк, 
							ВыборкаРаспоряжений.ВидОперации); 
																				  
			Если ЗначениеЗаполнено(ВидНумерации) Тогда																	  
																					  
				Отказ = Ложь;
				
				ТекНомерПодтверждения = СокрЛП(ВыборкаРаспоряжений.НомерПодтверждения);
					
				Если Справочники.ВидыНумерацииОбъектов.НомерСоответствуетФормату(ТекНомерПодтверждения, ВидНумерации, Отказ) Тогда
					
					РегистрыСведений.НомераОбъектов.ПроверитьУникальностьИЗарегистрироватьНовыйНомер(
						ТекНомерПодтверждения,
					    Организация,
						ВидНумерации,
						ВыборкаРаспоряжений.Распоряжение,
						?(ВидНумерации = Справочники.ВидыНумерацииОбъектов.ПодтвержденияВТБ, ВыборкаРаспоряжений.СчетДоверительногоУправления, Неопределено),
						Год(ВыборкаРаспоряжений.ДатаПодтверждения), 
						Отказ);
					
				КонецЕсли;
			
				Если Отказ Тогда
					ОтменитьТранзакцию();
					Продолжить;	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
				
		ДепозитСсылка = Справочники.ДепозитныеВклады.ПолучитьСсылку(Новый УникальныйИдентификатор);
		
		ДепозитныйВклад = Справочники.ДепозитныеВклады.СоздатьЭлемент();
		ДепозитныйВклад.УстановитьСсылкуНового(ДепозитСсылка);          
		
		ДепозитныйВклад.Организация		= Организация;
		ДепозитныйВклад.БанковскийСчет	= ВыборкаРаспоряжений.РасчетныйСчетДепозита;
		ДепозитныйВклад.МестоХранения	= ВыборкаРаспоряжений.МестоХранения;
		ДепозитныйВклад.ДатаРегистрации	= ВыборкаРаспоряжений.ДатаРазмещения;
		
		//Номер подтверждения заполняется только для клиентов, у которых заключено ген. соглашение по депозитным вкладам		
		ДепозитныйВклад.НомерПодтверждения						= ВыборкаРаспоряжений.НомерПодтверждения;
		ДепозитныйВклад.ДатаПодтверждения						= ВыборкаРаспоряжений.ДатаПодтверждения;
		ДепозитныйВклад.ДатаНачалаНачисленияПроцентов			= ВыборкаРаспоряжений.ДатаРазмещения + (24 * 60 * 60);
		ДепозитныйВклад.ПроцентнаяСтавкаПриДосрочномЗакрытии	= ВыборкаРаспоряжений.ПроцентнаяСтавкаПриДосрочномЗакрытии;
		ДепозитныйВклад._НачальныйНоминал						= ВыборкаРаспоряжений.Сумма;
		
		ДепозитныйВклад.ДоВостребования		= ВыборкаРаспоряжений.ДоВостребования;
		ДепозитныйВклад.Субординированность	= ВыборкаРаспоряжений.Субординированность;
		РеквизитыДляНаименования			= РаботаСНормативноСправочнойИнформацией.ПолучитьЗадействованныеВНаименованииРеквизиты(ДепозитСсылка);
		ДепозитныйВклад.Наименование		= РаботаСНормативноСправочнойИнформацией.СформироватьНаименование(ДепозитСсылка, ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(ДепозитныйВклад, РеквизитыДляНаименования));		
		ДепозитныйВклад.Распоряжение		= ВыборкаРаспоряжений.Распоряжение; 
		
		Попытка
			ДепозитныйВклад.Записать();
		Исключение
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать депозитный вклад." + Символы.ПС + ОписаниеОшибки());
			ОтменитьТранзакцию();
			Продолжить;
			
		КонецПопытки;
		
		Запись = РегистрыСведений.УсловияКредитныхИнструментов.СоздатьМенеджерЗаписи();
		
		Запись.Период								= ВыборкаРаспоряжений.ДатаРазмещения;
		Запись.Организация							= Организация;
		Запись.КредитныйИнструмент					= ДепозитСсылка;
		Запись.ДатаНачалаДействияУсловий			= ВыборкаРаспоряжений.ДатаРазмещения;
		Запись.ДатаПогашения						= ВыборкаРаспоряжений.ДатаВозврата;
		Запись.ПериодичностьВыплатыПроцентов		= ВыборкаРаспоряжений.ПериодичностьВыплатыПроцентов;
		Запись.Процент								= ВыборкаРаспоряжений.Процент;
		Запись.УчетныйАктив							= ВыборкаРаспоряжений.УчетныйАктив;
		Запись.Действует							= Истина;
		Запись.РасчетныйСчетВозвратаДенежныхСредств	= ВыборкаРаспоряжений.РасчетныйСчетВозвратаДенежныхСредств;
				
		Попытка
			Запись.Записать();
		Исключение
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать условия кредитного инструмента." + Символы.ПС + ОписаниеОшибки());
			ОтменитьТранзакцию();
			Продолжить;
			
		КонецПопытки;
		
		ДепозитныйВклад.ПлановыеВыплаты.Загрузить(Справочники.ДепозитныеВклады.ПолучитьРасчетВыплат(ДепозитСсылка));
		ДепозитныйВклад.Записать();
				
		ЗафиксироватьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан депозитный вклад [" + ДепозитСсылка + "]");

		Если СоздатьРазмещение Тогда
			
			РазмещениеКредитногоИнструмента									= Документы.РазмещениеКредитногоИнструмента.СоздатьДокумент();
			
			РазмещениеКредитногоИнструмента.ДополнительныеСвойства.Вставить("ДепозитныйВклад", ДепозитСсылка);
			РазмещениеКредитногоИнструмента.Заполнить(ВыборкаРаспоряжений.Распоряжение);
			
			РазмещениеКредитногоИнструмента.Дата = ВыборкаРаспоряжений.ДатаРазмещения + (ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса())); 
						
			РаботаСДокументами.ЗаписатьПровестиДокумент(РазмещениеКредитногоИнструмента);
						
		Иначе
			
			МассивДепозитныхВкладов.Добавить(ДепозитСсылка);
	
		КонецЕсли;
						
	КонецЦикла;
	
	Если Не СоздатьРазмещение Тогда
		Возврат МассивДепозитныхВкладов;
	КонецЕсли;

КонецФункции

Функция ПолучитьСтруктуруБанковДляКоторыхНастроеныФормыПодтверждений() Экспорт
		
	СтруктураБанков = Новый Структура();
	
	СтруктураБанков.Вставить("Банк_ГПБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ГПБ"));
	СтруктураБанков.Вставить("Банк_Сбер", ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_Сбер"));
	СтруктураБанков.Вставить("Банк_ДомРФ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ДомРФ"));
	СтруктураБанков.Вставить("Банк_РСХБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_РСХБ"));
	
	Возврат СтруктураБанков;
	
КонецФункции

Функция СформироватьТикеты(ПараметрыПечати) Экспорт 
		 
	Макет = ПараметрыПечати.Макеты.Распоряжение;	
	                                                         
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Распоряжение.Ссылка КАК Ссылка,
		|	Распоряжение.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА Распоряжение.ДатаРазмещения
		|		КОГДА Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА НАЧАЛОПЕРИОДА(Распоряжение.Дата, ДЕНЬ)
		|	КОНЕЦ КАК ДатаРазмещения,
		|	ВЫБОР
		|		КОГДА Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА Распоряжение.Банк.ЮрФизЛицо
		|		КОГДА Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА Распоряжение.РасчетныйСчет.Банк.ЮрФизЛицо
		|	КОНЕЦ КАК Банк,
		|	Распоряжение.РасчетныйСчет КАК РасчетныйСчетСписания,
		|	Распоряжение.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Распоряжение.Сумма КАК Сумма,
		|	Распоряжение.Процент КАК Процент,
		|	Распоряжение.ДатаВозврата КАК ДатаВозврата,
		|	Распоряжение.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	Распоряжение.ДоВостребования КАК ДоВостребования,
		|	Распоряжение.ВидОперации КАК ВидОперации,
		|	Распоряжение.Комментарий КАК Комментарий,
		|	Распоряжение.ПодОжидаемоеПоступлениеДенежныхСредств КАК ПодОжидаемоеПоступлениеДенежныхСредств
		|ПОМЕСТИТЬ _РаспоряженияНаДату
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Распоряжение.Дата, ДЕНЬ) = &ПараметрыПечатиДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РаспоряженияНаДату.Дата КАК Дата,
		|	_РаспоряженияНаДату.Банк КАК Банк
		|ПОМЕСТИТЬ _ГруппыРаспоряженийНаМНО
		|ИЗ
		|	_РаспоряженияНаДату КАК _РаспоряженияНаДату
		|ГДЕ
		|	_РаспоряженияНаДату.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ГруппыРаспоряженийНаМНО.Дата КАК Дата,
		|	_ГруппыРаспоряженийНаМНО.Банк КАК Банк,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _ПредыдущиеГруппыРаспоряженийНаМНО.Дата) КАК Номер
		|ПОМЕСТИТЬ _НомераГрупп
		|ИЗ
		|	_ГруппыРаспоряженийНаМНО КАК _ГруппыРаспоряженийНаМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГруппыРаспоряженийНаМНО КАК _ПредыдущиеГруппыРаспоряженийНаМНО
		|		ПО _ГруппыРаспоряженийНаМНО.Банк = _ПредыдущиеГруппыРаспоряженийНаМНО.Банк
		|			И _ГруппыРаспоряженийНаМНО.Дата >= _ПредыдущиеГруппыРаспоряженийНаМНО.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	_ГруппыРаспоряженийНаМНО.Дата,
		|	_ГруппыРаспоряженийНаМНО.Банк
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РаспоряженияНаДату.Ссылка КАК Ссылка,
		|	_РаспоряженияНаДату.Дата КАК Дата,
		|	_РаспоряженияНаДату.ДатаРазмещения КАК ДатаРазмещения,
		|	_РаспоряженияНаДату.Банк КАК Банк,
		|	_РаспоряженияНаДату.РасчетныйСчетСписания КАК РасчетныйСчетСписания,
		|	_РаспоряженияНаДату.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
		|	_РаспоряженияНаДату.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_РаспоряженияНаДату.Сумма КАК Сумма,
		|	_РаспоряженияНаДату.Процент КАК Процент,
		|	_РаспоряженияНаДату.ДатаВозврата КАК ДатаВозврата,
		|	_РаспоряженияНаДату.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_РаспоряженияНаДату.ДоВостребования КАК ДоВостребования,
		|	_РаспоряженияНаДату.ВидОперации КАК ВидОперации,
		|	_РаспоряженияНаДату.Комментарий КАК Комментарий,
		|	_РаспоряженияНаДату.ПодОжидаемоеПоступлениеДенежныхСредств КАК ПодОжидаемоеПоступлениеДенежныхСредств
		|ПОМЕСТИТЬ _Распоряжения
		|ИЗ
		|	_РаспоряженияНаДату КАК _РаспоряженияНаДату
		|ГДЕ
		|	_РаспоряженияНаДату.Ссылка В(&Распоряжения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Распоряжения.Ссылка КАК Ссылка,
		|	_Распоряжения.ВидОперации КАК ВидОперации,
		|	&ВидПечати КАК ВидПечати,
		|	""Вид операции [%1] распоряжения [%2] не соответствует выбранному виду печати [%3]. Тикет не будет сформирован."" КАК ТекстОшибки
		|ПОМЕСТИТЬ _ОшибкиПечати
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|ГДЕ
		|	(&ВидПечати = ""ПечатьРаспоряженийМНО""
		|				И _Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ИЛИ &ВидПечати = ""ПечатьРаспоряженийНаРазмещениеДепозитов""
		|				И _Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыУБрокера
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&ПараметрыПечатиДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_Р.СчетДоверительногоУправления
		|					ИЗ
		|						_Распоряжения КАК _Р
		|					ГДЕ
		|						(_Р.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|							ИЛИ _Р.СчетДоверительногоУправления.ДатаРасторжения > &ПараметрыПечатиДата))) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ПараметрыПечатиДата, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация = УсловияДоговоровОбщиеСрезПоследних.Организация
		|			И КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &ПараметрыПечатиДата)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КодыУБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КодыУБрокера.Код КАК Код
		|ПОМЕСТИТЬ _ЕдиничныеКодыУБрокера
		|ИЗ
		|	_КодыУБрокера КАК _КодыУБрокера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_КодыУБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|		ИЗ
		|			_КодыУБрокера КАК _КодыУБрокера
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_КодыУБрокера.СчетДоверительногоУправления
		|		
		|		ИМЕЮЩИЕ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _КодыУБрокера.Код) = 1) КАК ВложенныйЗапрос
		|		ПО _КодыУБрокера.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо КАК Филиал,
		|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо КАК Родитель
		|ПОМЕСТИТЬ _ГоловныеОрганизацииБанков
		|ИЗ
		|	РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(
		|			&ПараметрыПечатиДата,
		|			ЮридическоеЛицо В
		|					(ВЫБРАТЬ
		|						_Распоряжения.Банк
		|					ИЗ
		|						_Распоряжения КАК _Распоряжения)
		|				И ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
		|ГДЕ
		|	СвязанныеЮридическиеЛицаСрезПоследних.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование КАК СокращенноеНаименование,
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК БанкЮрФизЛицо
		|ПОМЕСТИТЬ _РеквизитыБанков
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&ПараметрыПечатиДата,
		|			ЮрФизЛицо В
		|					(ВЫБРАТЬ
		|						_Распоряжения.Банк
		|					ИЗ
		|						_Распоряжения КАК _Распоряжения
		|			
		|					ОБЪЕДИНИТЬ
		|			
		|					ВЫБРАТЬ
		|						_ГоловныеОрганизацииБанков.Родитель
		|					ИЗ
		|						_ГоловныеОрганизацииБанков КАК _ГоловныеОрганизацииБанков)
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РейтингиСрезПоследних.Субъект КАК БанкЮрФизЛицо,
		|	РейтингиСрезПоследних.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	РейтингиСрезПоследних.Шкала КАК Шкала,
		|	РейтингиСрезПоследних.Рейтинг КАК Рейтинг
		|ПОМЕСТИТЬ _РейтингиБанков
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_Распоряжения.Банк КАК БанкЮрФизЛицо
		|	ИЗ
		|		_Распоряжения КАК _Распоряжения
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ГоловныеОрганизацииБанков.Родитель
		|	ИЗ
		|		_ГоловныеОрганизацииБанков КАК _ГоловныеОрганизацииБанков) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Рейтинги.СрезПоследних(
		|				&ПараметрыПечатиДата,
		|				Агрегатор = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.РуДата)
		|					И РейтинговоеАгентство В (&Агентство_AKRA, &Агентство_RAEX)
		|					И Шкала В (&Шкала_AKRA, &Шкала_RAEX)) КАК РейтингиСрезПоследних
		|		ПО ВложенныйЗапрос.БанкЮрФизЛицо = РейтингиСрезПоследних.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Распоряжения.Ссылка КАК Ссылка,
		|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Распоряжения.СчетДоверительногоУправления.Наименование КАК НаименованиеКлиента,
		|	_ЕдиничныеКодыУБрокера.Код КАК КодУБрокера,
		|	ЕСТЬNULL(_РеквизитыГоловныхОрганизацийБанков.СокращенноеНаименование, _РеквизитыБанков.СокращенноеНаименование) КАК СокращенноеНаименованиеБанка,
		|	ВЫБОР
		|		КОГДА НЕ ЕСТЬNULL(РейтингиГоловныхБанковAKRA.Рейтинг, РейтингиБанковAKRA.Рейтинг) ЕСТЬ NULL
		|			ТОГДА ""АКРА:"" + ЕСТЬNULL(РейтингиГоловныхБанковAKRA.Рейтинг, РейтингиБанковAKRA.Рейтинг) + "" ""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НЕ ЕСТЬNULL(РейтингиГоловныхБанковRAEX.Рейтинг, РейтингиБанковRAEX.Рейтинг) ЕСТЬ NULL
		|			ТОГДА ""RAEX:"" + ЕСТЬNULL(РейтингиГоловныхБанковRAEX.Рейтинг, РейтингиБанковRAEX.Рейтинг)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК РейтингБанка,
		|	_Распоряжения.Сумма КАК Сумма,
		|	_Распоряжения.Процент КАК Процент,
		|	_Распоряжения.ДатаВозврата КАК ДатаВозврата,
		|	РАЗНОСТЬДАТ(_Распоряжения.ДатаРазмещения, _Распоряжения.ДатаВозврата, ДЕНЬ) КАК СрокРазмещения,
		|	РАЗНОСТЬДАТ(&ПараметрыПечатиДата, _Распоряжения.ДатаВозврата, ДЕНЬ) КАК РазностьДат,
		|	_Распоряжения.Комментарий КАК Комментарий,
		|	_Распоряжения.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_Распоряжения.ДоВостребования КАК ДоВостребования,
		|	_Распоряжения.ВидОперации КАК ВидОперации,
		|	_Распоряжения.ДатаРазмещения КАК ДатаРазмещения,
		|	_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента) КАК ФлагРазмещениеДепозита,
		|	_Распоряжения.ПодОжидаемоеПоступлениеДенежныхСредств КАК ПодОжидаемоеПоступлениеДенежныхСредств,
		|	_НомераГрупп.Номер КАК НомерГруппы
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыБанков КАК _РеквизитыБанков
		|		ПО _Распоряжения.Банк = _РеквизитыБанков.БанкЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РейтингиБанков КАК РейтингиБанковAKRA
		|		ПО (РейтингиБанковAKRA.РейтинговоеАгентство = &Агентство_AKRA)
		|			И (РейтингиБанковAKRA.Шкала = &Шкала_AKRA)
		|			И _Распоряжения.Банк = РейтингиБанковAKRA.БанкЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РейтингиБанков КАК РейтингиБанковRAEX
		|		ПО (РейтингиБанковRAEX.РейтинговоеАгентство = &Агентство_RAEX)
		|			И (РейтингиБанковRAEX.Шкала = &Шкала_RAEX)
		|			И _Распоряжения.Банк = РейтингиБанковRAEX.БанкЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГоловныеОрганизацииБанков КАК _ГоловныеОрганизацииБанков
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РейтингиБанков КАК РейтингиГоловныхБанковAKRA
		|			ПО (РейтингиГоловныхБанковAKRA.РейтинговоеАгентство = &Агентство_AKRA)
		|				И (РейтингиГоловныхБанковAKRA.Шкала = &Шкала_AKRA)
		|				И _ГоловныеОрганизацииБанков.Родитель = РейтингиГоловныхБанковAKRA.БанкЮрФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РейтингиБанков КАК РейтингиГоловныхБанковRAEX
		|			ПО (РейтингиГоловныхБанковRAEX.РейтинговоеАгентство = &Агентство_RAEX)
		|				И (РейтингиГоловныхБанковRAEX.Шкала = &Шкала_RAEX)
		|				И _ГоловныеОрганизацииБанков.Родитель = РейтингиГоловныхБанковRAEX.БанкЮрФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыБанков КАК _РеквизитыГоловныхОрганизацийБанков
		|			ПО _ГоловныеОрганизацииБанков.Родитель = _РеквизитыГоловныхОрганизацийБанков.БанкЮрФизЛицо
		|		ПО _Распоряжения.Банк = _ГоловныеОрганизацииБанков.Филиал
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЕдиничныеКодыУБрокера КАК _ЕдиничныеКодыУБрокера
		|		ПО _Распоряжения.СчетДоверительногоУправления = _ЕдиничныеКодыУБрокера.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиПечати КАК _ОшибкиПечати
		|		ПО _Распоряжения.Ссылка = _ОшибкиПечати.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НомераГрупп КАК _НомераГрупп
		|		ПО _Распоряжения.Дата = _НомераГрупп.Дата
		|			И _Распоряжения.Банк = _НомераГрупп.Банк
		|ГДЕ
		|	_ОшибкиПечати.Ссылка ЕСТЬ NULL
		|ИТОГИ
		|	МИНИМУМ(НомерГруппы)
		|ПО
		|	ДатаРазмещения,
		|	СокращенноеНаименованиеБанка,
		|	ПериодичностьВыплатыПроцентов,
		|	ДоВостребования
		|АВТОУПОРЯДОЧИВАНИЕ";	
#КонецОбласти
	
	Запрос.УстановитьПараметр("Организация", ПараметрыПечати.Организация);
	Запрос.УстановитьПараметр("Распоряжения", ПараметрыПечати.Распоряжения);
	Запрос.УстановитьПараметр("ПараметрыПечатиДата", ПараметрыПечати.Дата);
	Запрос.УстановитьПараметр("ВидПечати", ПараметрыПечати.ВидПечати);
	Запрос.УстановитьПараметр("Агентство_AKRA", ОбщегоНазначения.ПолучитьИменованныйОбъект("Агентство_AKRA")); 
	Запрос.УстановитьПараметр("Агентство_RAEX", ОбщегоНазначения.ПолучитьИменованныйОбъект("Агентство_RAEX"));
	Запрос.УстановитьПараметр("Шкала_AKRA", ОбщегоНазначения.ПолучитьИменованныйОбъект("Шкала_AKRA-I-Cr&D-LT-Nsc"));
	Запрос.УстановитьПараметр("Шкала_RAEX", ОбщегоНазначения.ПолучитьИменованныйОбъект("Шкала_EXP-B-Cr&D-Nsc"));
			
	Шапка  = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
			
	МассивТикетов = Новый Массив;
	
	ВыборкаГруппировкаПоДатеРазмещения = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппировкаПоДатеРазмещения.Следующий() Цикл 
	
		ВыборкаГруппировкаПоБанку = ВыборкаГруппировкаПоДатеРазмещения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаГруппировкаПоБанку.Следующий() Цикл
			
			ВыборкаГруппировкаПоПериодичности = ВыборкаГруппировкаПоБанку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаГруппировкаПоПериодичности.Следующий() Цикл
				
				ВыборкаГруппировкаПоУсловиюДоВостребования = ВыборкаГруппировкаПоПериодичности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаГруппировкаПоУсловиюДоВостребования.Следующий() Цикл
										
					ТабДок = Новый ТабличныйДокумент;
					ТабДок.КлючПараметровПечати = "ПечатьРаспоряжений";
					
					Шапка.Параметры.СокращенноеНаименованиеБанка = ВыборкаГруппировкаПоУсловиюДоВостребования.СокращенноеНаименованиеБанка;
					Шапка.Параметры.ПрефиксНумерации = ПараметрыПечати.Организация.ПрефиксНумерации;
					ТабДок.Вывести(Шапка, ВыборкаГруппировкаПоУсловиюДоВостребования.Уровень());

					ВыборкаДетальныеЗаписи = ВыборкаГруппировкаПоУсловиюДоВостребования.Выбрать();
					
					ЗаполненыДопУсловияДепозитов = Ложь;
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						Строка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
						
						Если ВыборкаДетальныеЗаписи.ПодОжидаемоеПоступлениеДенежныхСредств Тогда
							Строка.Параметры.Комментарий = "МНО под ожидаемое поступление д/с";
						КонецЕсли;

						Если ВыборкаДетальныеЗаписи.ФлагРазмещениеДепозита Тогда
							
							Если Не ЗаполненыДопУсловияДепозитов Тогда
								
								ОбластьДопУсловий = Макет.ПолучитьОбласть("СтрокаДопУсловий|ДопУсловия");

								ОбластьДопУсловий.Параметры.ПериодичностьВыплатыПроцентов = "% " + НРег(ВыборкаДетальныеЗаписи.ПериодичностьВыплатыПроцентов);
								ОбластьДопУсловий.Параметры.ЕстьПравоРасторжения = ?(ВыборкаДетальныеЗаписи.ДоВостребования, "х", "");
								ОбластьДопУсловий.Параметры.НетПраваРасторжения = ?(ВыборкаДетальныеЗаписи.ДоВостребования, "", "х");
								ОбластьДопУсловий.Параметры.РейтингБанка = ВыборкаДетальныеЗаписи.РейтингБанка;
								
								ЗаполненыДопУсловияДепозитов = Истина;
								
							КонецЕсли;
							
						Иначе
							Строка.Область(1, 5, 1, 5).ЦветФона = ?(ВыборкаДетальныеЗаписи.РазностьДат > 1, Новый Цвет(255,255,153), Новый Цвет(255,255,255));		
						КонецЕсли;
						
						ТабДок.Вывести(Строка, ВыборкаДетальныеЗаписи.Уровень());
							
					КонецЦикла;
					
					Если ЗаполненыДопУсловияДепозитов Тогда
						
						КоличествоЗаписей = ВыборкаДетальныеЗаписи.Количество();
						
						Пока КоличествоЗаписей < 6 Цикл
							
							ТабДок.Вывести(Макет.ПолучитьОбласть(17, 1, 17, 6), ВыборкаДетальныеЗаписи.Уровень());
							КоличествоЗаписей = КоличествоЗаписей + 1;
							
						КонецЦикла;
												
						ТабДок.ВставитьОбласть(ОбластьДопУсловий.Область(1, 1, 6, 3), ТабДок.Область(11, 7, 16, 9), ТипСмещенияТабличногоДокумента.БезСмещения, Истина);
						
					КонецЕсли;
						
					Подвал.Параметры.Заполнить(ПараметрыПечати);
					Подвал.Параметры.Дата = Формат(ВыборкаГруппировкаПоУсловиюДоВостребования.ДатаРазмещения, "ДФ=dd.MM.yyyy");
					Подвал.Параметры.ДатаПечати = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
					Подвал.Параметры.ВремяПечати = Формат(ТекущаяДата(), "ДФ=ЧЧ:мм");
					
					ТабДок.Вывести(Подвал);
					
					ТабДок.ОтображатьСетку = Ложь;
					ТабДок.Защита = Ложь;
					ТабДок.ТолькоПросмотр = Ложь;
					ТабДок.ОтображатьЗаголовки = Ложь;
					
					ИмяФайла = Формат(ПараметрыПечати.Дата, "ДФ=yyyy.MM.dd") 
							+ ?(ПараметрыПечати.ВидПечати = "ПечатьРаспоряженийМНО", "_МНО_", "_Депозит_") 
							+ РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(Строка(ПараметрыПечати.Организация) 
							+ "_" + ВыборкаГруппировкаПоУсловиюДоВостребования.СокращенноеНаименованиеБанка) 
							+ ?(ЗначениеЗаполнено(ВыборкаГруппировкаПоУсловиюДоВостребования.НомерГруппы), "_" + Строка(ВыборкаГруппировкаПоУсловиюДоВостребования.НомерГруппы), "") + ".xlsx"; 
	
					МассивТикетов.Добавить(Новый Структура("ИмяПапки, ИмяФайла, ТипФайла, ТабличныйДокумент", "", ИмяФайла, ТипФайлаТабличногоДокумента.XLSX, ТабДок));
					
				КонецЦикла;
					
			КонецЦикла;
					
		КонецЦикла;
		
	КонецЦикла;
	
	ВыборкаОшибокПечати = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиПечати"].ПолучитьДанные().Выбрать();
	
	Пока ВыборкаОшибокПечати.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ВыборкаОшибокПечати.ТекстОшибки, ВыборкаОшибокПечати.ВидОперации, ВыборкаОшибокПечати.Ссылка, ВыборкаОшибокПечати.ВидПечати));	
	КонецЦикла;
		
	Возврат МассивТикетов;
		
КонецФункции
